In [1]:
import numpy as np
import pandas as pd
import pickle

In [25]:
df = pd.read_csv('/Users/PKLAT/Desktop/Data Glacier/Week 5/price.csv')

In [26]:
df.head()

  bed_room    area  house_age  price
0      NaN  2300.0          9  50000
1      NaN  2152.0          6  45000
2     five  8520.0          7  60000
3      two  9025.0         10  65000
4    seven  9900.0          6  70000

In [27]:
df.shape

(8, 4)

In [28]:
df

  bed_room    area  house_age  price
0      NaN  2300.0          9  50000
1      NaN  2152.0          6  45000
2     five  8520.0          7  60000
3      two  9025.0         10  65000
4    seven  9900.0          6  70000
5    three  8045.0         10  62000
6      ten  9564.0          7  72000
7   eleven     NaN          8  80000

In [29]:
df['bed_room'].fillna(0,inplace=True)

In [30]:
df

  bed_room    area  house_age  price
0        0  2300.0          9  50000
1        0  2152.0          6  45000
2     five  8520.0          7  60000
3      two  9025.0         10  65000
4    seven  9900.0          6  70000
5    three  8045.0         10  62000
6      ten  9564.0          7  72000
7   eleven     NaN          8  80000

In [31]:
df['area'].fillna(df['area'].mean(),inplace=True)

In [32]:
df

  bed_room         area  house_age  price
0        0  2300.000000          9  50000
1        0  2152.000000          6  45000
2     five  8520.000000          7  60000
3      two  9025.000000         10  65000
4    seven  9900.000000          6  70000
5    three  8045.000000         10  62000
6      ten  9564.000000          7  72000
7   eleven  7072.285714          8  80000

In [33]:
df['bed_room'] = df['bed_room'].map({'one':1, 'two':2, 'three':3, 'four':4, 'five':5, 'six':6, 'seven':7, 'eight':8, 'nine':9, 'ten':10, 0:0,'zero':0, 'eleven':11,'twelve':12})

In [34]:
df

   bed_room         area  house_age  price
0         0  2300.000000          9  50000
1         0  2152.000000          6  45000
2         5  8520.000000          7  60000
3         2  9025.000000         10  65000
4         7  9900.000000          6  70000
5         3  8045.000000         10  62000
6        10  9564.000000          7  72000
7        11  7072.285714          8  80000

In [36]:
df['bed_room'].dtype

dtype('int64')

In [37]:
y=df['price']
x=df.drop('price', axis=1)

In [38]:
y

0    50000
1    45000
2    60000
3    65000
4    70000
5    62000
6    72000
7    80000
Name: price, dtype: int64

In [39]:
x

   bed_room         area  house_age
0         0  2300.000000          9
1         0  2152.000000          6
2         5  8520.000000          7
3         2  9025.000000         10
4         7  9900.000000          6
5         3  8045.000000         10
6        10  9564.000000          7
7        11  7072.285714          8

In [44]:
from sklearn.linear_model import LinearRegression

In [45]:
ln = LinearRegression()

In [46]:
ln.fit(x,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

- Saving the model

In [48]:
pickle.dump(ln, open('linearReg_model.pkl', 'wb'))

- Loading the model to make prediction

In [49]:
model = pickle.load(open('linearReg_model.pkl','rb'))
print(model.predict([[2, 2200, 5]]))

[47236.36685239]